Revit 2027 API
UIApplication.GetRibbonPanels Method
Overload List
Name | Description
GetRibbonPanels() |  Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String) |  Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab) |  Get all the custom Panels on a designated standard Revit tab.
Top
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace